import React from "react";
import { Card, Flex } from "antd";

const traning = [
  {
    id: 1,
    header: "КАБАЧКИ ЗАПЕЧЕННЫЕ С СЫРОМ В ДУХОВКЕ ПП",
    img: "https://static.1000.menu/res/640/img/content-v2/a2/c2/40648/kabachki-zapechennye-s-syrom-v-duxovke_1573560941_6_max.jpg",
    description:
      "ШАГ 1:\n" +
      "Как сделать кабачки запеченные с сыром в духовке ПП? Подготовьте указанные продукты. Кабачки выбирайте молодые с тонкой шкуркой, можно взять один средний или, как у меня, два маленьких. Сметану можно брать любой жирности, сыр твёрдый (у меня Пармезан), но можно выбрать любой на свой вкус. Как заменять разные виды сыров читайте в статье в конце рецепта. Включите разогреваться духовку на 180 градусов.\n" +
      "\n" +
      "Шаг 2.\n" +
      "Кабачки вымойте в проточной воде и обсушите полотенцем. Нарежьте кружочками толщиной 0,5 сантиметров. Форму для выпечки или противень застелите бумагой для выпечки и выложите на неё кружочки. Кружки можно посолить отдельно, а можно не солить, ведь в сметанно-чесночной шапочке тоже будет соль.\n" +
      "\n" +
      "Шаг 3.\n" +
      "Чеснок очистите и пропустите через пресс. Сыр натрите на средней тёрке. Свежую сметану смешайте с измельчённым чесноком и натёртым сыром, добавьте немного соли. Количество чеснока регулируйте по своему вкусу. Выложите по 0,5-1 столовой ложке (в зависимости от диаметра кружка кабачка) сметанно-сырной смеси на каждый кружок кабачка.\n" +
      "\n" +
      "Шаг 4.\n" +
      "При приготовлении такого блюда можно перед запеканием посыпать кабачки нарезанной зеленью укропа, а можно это сделать уже после приготовления. Я сделала два варианта, и кабачок со свежей зеленью (не запечённой вместе с кабачком) мне показался ароматней и вкусней. Для первого варианта на этом шаге посыпьте измельчённой зеленью каждый кружок кабачка. Поставьте форму с кабачками в духовку, выпекайте примерно 20 - 25 минут.\n" +
      "\n" +
      "Шаг 5.\n" +
      "Время выпекания кабачков с сыром и сметаной вас может быть другое. О работе духовок читайте в статье под шагами. Готовые кабачки запеченные с сыром и чесноком можно подавать как горячими, так и остывшими. Они могут выступать как горячая закуска, как самостоятельное блюдо и как гарнир. Приятного аппетита!",
  },
  {
    id: 2,
    header: "ТВОРОГ С БАНАНОМ",
    img: "https://static.1000.menu/res/640/img/content-v2/65/97/40300/tvorog-s-bananom_1572608832_12_max.jpg",
    description:
      "ПОШАГОВОЕ ПРИГОТОВЛЕНИЕ\n" +
      " Время приготовления: 15 мин\n" +
      "ШАГ 1:\n" +
      "Как сделать творог с бананом? Подготовьте необходимые ингредиенты. Если это лакомство готовится для детей, то творог лучше использовать натуральный деревенский, с высоким процентом жирности. Для тех, кто следит за своей фигурой, можно взять обезжиренный продукт. Советую использовать мед или сахарозаменитель вместо сахара, но у меня меда в этот раз не оказалось. Бананы лучше использовать хорошо спелые, чтобы они дали больше сладости десерту.\n" +
      "\n" +
      "ШАГ 2:\n" +
      "Бананы помойте, очистите, нарежьте небольшими кусочками и отправьте в чашу блендера.\n" +
      "\n" +
      "ШАГ 3:\n" +
      "Измельчите бананы до состояния пюре, если не получается, и банан остается кусочками, нужно добавить немного кипяченой холодной воды и снова включить блендер на пару минут.\n" +
      "\n" +
      "ШАГ 4:\n" +
      "Добавьте к банану творог и сметану. Если творог слишком сухой или зернистый, то лучше заранее его протереть его через сито. Сметану можно использовать любой жирности. Для улучшения вкуса можно положить щепотку ванилина.\n" +
      "\n" +
      "ШАГ 5:\n" +
      "Блендером взбейте все ингредиенты до получения однородной по консистенции массы.\n" +
      "\n" +
      "ШАГ 6:\n" +
      "По вкусу добавьте сахар, мед или любой другой подсластитель. Еще раз перемешайте все ингредиенты блендером. Творожная масса должна стать немного пышной и воздушной при взбивании.\n" +
      "\n" +
      "ШАГ 7:\n" +
      "Вкус десерта можно разнообразить, используя различные добавки, например, грецкие орехи. Кроме приятного орехового привкуса они сделают лакомство более полезным. Можно также добавить песочное печенье, Оставшийся банан нарежьте на кружочки, из них сделайте прослойку десерта и украшение для него.\n" +
      "\n" +
      "ШАГ 8:\n" +
      "Заполните пиалы или стаканчики творожной массы до половины, , сверху положите несколько кусочков банана и печенья по желанию, а затем выложите оставшуюся творожную массу. Украсьте десерт измельченным грецким орехом, крошкой печенья, кружочками банана и листочком мяты. Бананы с творогом без выпечки готовы. Перед подачей к столу десерт можно охладить в холодильнике. Приятного аппетита!",
  },
  {
    id: 3,
    header: "КРЕВЕТКИ С СЫРОМ ЗАПЕЧЕННЫЕ",
    img: "https://static.1000.menu/res/640/img/content-v2/ff/ac/4119/zapechennye-krevetki-s-syrom_1610088949_12_max.jpg",
    description:
      "ПОШАГОВОЕ ПРИГОТОВЛЕНИЕ\n" +
      " Время приготовления: 20 мин\n" +
      "ШАГ 1:\n" +
      "Как запечь креветки с сыром? Подготовьте все необходимые продукты. Выньте креветки из морозильной камеры и оставьте при комнатной температуре до полного оттаивания. Когда мне нужно разморозить креветки быстро, я заливаю их прохладной водой, спустя 20-30 минут воду сливаю, а ракообразных обсушиваю бумажными полотенцами.\n" +
      "\n" +
      "ШАГ 2:\n" +
      "Лук и чеснок очистите от кожуры. У фасоли срежьте хвостики. Если вы используете зрелые стручки, удалите усики по бокам. Лимон, лук и чеснок ополосните. Рассольный сыр измельчите руками или ножом на небольшие фрагменты.\n" +
      "\n" +
      "ШАГ 3:\n" +
      "Креветки очистите от панцирей, удалите головы и хвосты. Уберите вену на спинке каждого ракообразного. Обсушите мясо креветок салфетками.\n" +
      "\n" +
      "ШАГ 4:\n" +
      "Отправьте креветки в глубокую тарелку или иную ёмкость. Добавьте оливковое или любое растительное масло без запаха, выжмите половину лимона, посолите, поперчите. Чеснок нашинкуйте ножом или пропустите через пресс, отправьте в тарелку. Всё тщательно перемешай и оставьте промариноваться на 5-10 минут.\n" +
      "\n" +
      "ШАГ 5:\n" +
      "В это время залейте стручки фасоли кипятком и оставьте таким образом на пару минут. Если фасоль не очень молодая, то закиньте её в кипящую воду и проварите одну-две минуты, тогда она в готовом блюде будет более мягкая.\n" +
      "\n" +
      "ШАГ 6:\n" +
      "На дно формы для запекания выложите ровным слоем зелёную фасоль.\n" +
      "\n" +
      "Шаг 7.\n" +
      "Уложите сверху маринованные креветки, а так же лук, предварительно нарезанный не очень тонкими перьями. Для более аппетитного вида готового блюда я использовала красный лук, но можно взять обычный репчатый. Маринад, который остался от креветок, распределите поверх продуктов.\n" +
      "\n" +
      "Шаг 8.\n" +
      'Поставьте форму в заранее разогретую духовку и запекайте около 10 минут при температуре 180-200 градусов на режиме "верх-низ". Время запекания может немного увеличится, ориентируйте на креветки, они должны покраснеть и скрутиться в колечки. Выньте креветки из духовки и сразу же посыпьте сыром. Пока блюдо горячее, сыр слегка расплавится, что придаст особую изюминку креветкам с овощами. Распределите оливки поверх сыра и креветок. Посыпьте блюдо зеленью.\n' +
      "\n" +
      "Шаг 9.\n" +
      "При желании перед подачей сбрызните ещё раз соком лимона и слегка поперчите. Готово!",
  },
  {
    id: 4,
    header: "КУРИНАЯ ПЕЧЕНЬ С ПОДЛИВКОЙ НА СКОВОРОДЕ С ЛУКОМ",
    img: "https://static.1000.menu/res/640/img/content-v2/8b/76/34112/podliva-iz-kurinoi-pecheni-so-smetanoi-i-lukom_1610162948_12_max.jpg",
    description:
      "ПОШАГОВОЕ ПРИГОТОВЛЕНИЕ\n" +
      " Время приготовления: 20 мин\n" +
      "ШАГ 1:\n" +
      "Как сделать куриную печень с подливой на сковороде? Подготовьте для этого все необходимые ингредиенты. Если куриная печень замороженная, то заранее вытащите её из морозильной камеры и оставьте при комнатной температуре, чтобы она самостоятельно разморозилась. Затем промойте её в проточной воде и обсушите. Если у вас лук мелкий, то можно взять 2-3 луковицы. У меня одна, но крупная.\n" +
      "\n" +
      "Шаг 2.\n" +
      "Лук очистите от шелухи, ополосните в холодной воде и нарежьте полукольцами. Сковороду для жарки разогрейте до горячего состояния и налейте на неё немного растительного масла. Выложите нарезанные лук и обжарьте 1-2 минуты, чтобы он стал прозрачный.\n" +
      "\n" +
      "ШАГ 3:\n" +
      "Морковь очистите и натрите на терке. Затем добавьте тертую морковь в сковороду к луку. На среднем огне обжаривайте овощи ещё пару минут, периодически помешивая.\n" +
      "\n" +
      "ШАГ 4:\n" +
      "Печень нарежьте на кусочки и выложите в сковороду к овощам. Все перемешайте. Через 2-3 минуты жарки печень изменит свой цвет.\n" +
      "\n" +
      "ШАГ 5:\n" +
      "Кетчуп размешайте с небольшим количеством воды и влейте в сковороду. Количество воды регулируйте на свой вкус. Я люблю, чтобы подливы было больше. Доведите все до кипения. По вкусу добавьте немного соли и специи. Накройте крышкой и тушите на небольшом огне 5-7 минут.\n" +
      "\n" +
      "ШАГ 6:\n" +
      "Куриная печень готовится очень быстро. Разломайте кусочек - он должен быть равномерно серого цвета, без розового оттенка. Если кетчуп кисловат, то можно добавить немного сахара. За время тушения подлива немного загустеет.\n" +
      "\n" +
      "Шаг 7.\n" +
      "Готовую куриную печень можно дополнить гарниром из картофельного пюре. Приятного аппетита!",
  },
];

const Recipe = () => {
  return (
    <Flex
      vertical
      align={"center"}
      gap={30}
      style={{
        paddingTop: 20,
        width: "clamp(100px,100%,600px)",
        margin: "auto",
      }}
    >
      {traning.map((train) => (
        <Card key={train.id}>
          <Flex vertical gap={25}>
            <h2>{train.header}</h2>
            <img
              style={{
                width: "clamp(100px,100%,600px)",
              }}
              src={train.img}
            />
            <p>{train.description}</p>
          </Flex>
        </Card>
      ))}
    </Flex>
  );
};

export default Recipe;
